application/app/Controllers/Dashboard.php

    public function index()
    {
        //if (!session()->has('email')) {
            //return redirect()->to(base_url('auth'));
       // }

        $locacao = new ImoveisModel();
        $venda = new ImoveisModel();
        $casa = new ImoveisModel();
        $apartamento = new ImoveisModel();
        $condominio = new ImoveisModel();
        $loja = new ImoveisModel();
        $terreno = new ImoveisModel();

        $locacao->where('categoria', 'Locação');
        $venda->where('categoria', 'Venda');
        $casa->where('tipo', 'Casa');
        $apartamento->where('tipo', 'Apartamento');
        $condominio->where('tipo', 'Condomínio');
        $loja->where('tipo', 'Loja');
        $terreno->where('tipo', 'Terreno');

        $data = [
            'locacao' => $locacao->findAll(),
            'venda' => $venda->findAll(),
            'casa' => $casa->findAll(),
            'apartamento' => $apartamento->findAll(),
            'condominio' => $condominio->findAll(),
            'loja' => $loja->findAll(),
            'terreno' => $terreno->findAll()
        ];
---
SELECT *
FROM `imoveis`
WHERE `categoria` = 'Locação'
SELECT *
FROM `imoveis`
WHERE `categoria` = 'Venda'
SELECT *
FROM `imoveis`
WHERE `tipo` = 'Casa'
SELECT *
FROM `imoveis`
WHERE `tipo` = 'Apartamento'
SELECT *
FROM `imoveis`
WHERE `tipo` = 'Condomínio'
SELECT *
FROM `imoveis`
WHERE `tipo` = 'Loja'
SELECT *
FROM `imoveis`
WHERE `tipo` = 'Terreno'