application/app/Controllers/Encarte.php

    public function index()
    {

        if (!session()->has('email')) {
            return redirect()->to(base_url('auth'));
       }

        $imoveis = new ImoveisModel();
        $data = [
            'imoveis' => $imoveis->findAll(),
        ];
---
SELECT *
FROM `imoveis`

    public function new()
    {
        if (!session()->has('email')) {
            return redirect()->to(base_url('auth'));
       }
        $tipos = new TipoModel();
        $categorias = new CategoriaModel();

        $data = [
            'tipos' => $tipos->findAll(),
            'categorias' => $categorias->findAll()
        ];
---
SELECT *
FROM `tipos`
SELECT *
FROM `categorias`